rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>PDCRE</name>
               <displayName>PDCRE</displayName>
               <description>Power Port E pull-down control           register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD13</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD12</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD11</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD10</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRF</name>
               <displayName>PUCRF</displayName>
               <description>Power Port F pull-up control           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU15</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU14</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU13</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU12</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU11</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU10</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU9</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU8</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU7</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU6</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU5</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU4</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>Port F pull-up bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRF</name>
               <displayName>PDCRF</displayName>
               <description>Power Port F pull-down control           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD13</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD12</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD11</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD10</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port F pull-down bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRG</name>
               <displayName>PUCRG</displayName>
               <description>Power Port G pull-up control           register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU10</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU9</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU8</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU7</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU6</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU5</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU4</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>Port G pull-up bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRG</name>
               <displayName>PDCRG</displayName>
               <description>Power Port G pull-down control           register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD10</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port G pull-down bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR5</name>
               <displayName>CR5</displayName>
               <description>Power control register 5</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000100</resetValue>
               <fields>
                  <field>
                     <name>R1MODE</name>
                     <description>Main regular range 1 mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
