rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="UART4">
         <name>UART5</name>
         <baseAddress>0x40005000</baseAddress>
         <interrupt>
            <name>UART5</name>
            <description>UART5</description>
            <value>53</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>LPUART1</name>
         <description>Universal synchronous asynchronous receiver       transmitter</description>
         <groupName>USART</groupName>
         <baseAddress>0x40008000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LPTIM1</name>
            <description>LPTIM1</description>
            <value>49</value>
         </interrupt>
         <interrupt>
            <name>LPUART</name>
            <description>LPUART</description>
            <value>91</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>Control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RXFFIE</name>
                     <description>RXFFIE</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFEIE</name>
                     <description>TXFEIE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFOEN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M1</name>
                     <description>Word length</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEAT4</name>
                     <description>Driver Enable assertion               time</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEAT3</name>
                     <description>DEAT3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEAT2</name>
                     <description>DEAT2</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEAT1</name>
                     <description>DEAT1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEAT0</name>
                     <description>DEAT0</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT4</name>
                     <description>Driver Enable de-assertion               time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT3</name>
                     <description>DEDT3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT2</name>
                     <description>DEDT2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT1</name>
                     <description>DEDT1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT0</name>
                     <description>DEDT0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMIE</name>
                     <description>Character match interrupt               enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MME</name>
                     <description>Mute mode enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M0</name>
                     <description>Word length</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE</name>
                     <description>Receiver wakeup method</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCE</name>
                     <description>Parity control enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS</name>
                     <description>Parity selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEIE</name>
                     <description>PE interrupt enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEIE</name>
                     <description>interrupt enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transmission complete interrupt               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNEIE</name>
                     <description>RXNE interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLEIE</name>
                     <description>IDLE interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE</name>
                     <description>Transmitter enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE</name>
                     <description>Receiver enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UESM</name>
                     <description>USART enable in Stop mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UE</name>
                     <description>USART enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>Control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ADD4_7</name>
                     <description>Address of the USART node</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADD0_3</name>
                     <description>Address of the USART node</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MSBFIRST</name>
                     <description>Most significant bit first</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAINV</name>
                     <description>Binary data inversion</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXINV</name>
                     <description>TX pin active level               inversion</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXINV</name>
                     <description>RX pin active level               inversion</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAP</name>
                     <description>Swap TX/RX pins</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>STOP bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADDM7</name>
                     <description>7-bit Address Detection/4-bit Address               Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <displayName>CR3</displayName>
               <description>Control register 3</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TXFTCFG</name>
                     <description>TXFTCFG</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RXFTIE</name>
                     <description>RXFTIE</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFTCFG</name>
                     <description>RXFTCFG</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TXFTIE</name>
                     <description>TXFTIE</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUFIE</name>
                     <description>Wakeup from Stop mode interrupt               enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUS</name>
                     <description>Wakeup from Stop mode interrupt flag               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DEP</name>
                     <description>Driver enable polarity               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEM</name>
                     <description>Driver enable mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRE</name>
                     <description>DMA Disable on Reception               Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRDIS</name>
                     <description>Overrun Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIE</name>
                     <description>CTS interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSE</name>
                     <description>CTS enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTSE</name>
                     <description>RTS enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAT</name>
                     <description>DMA enable transmitter</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAR</name>
                     <description>DMA enable receiver</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDSEL</name>
                     <description>Half-duplex selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BRR</name>
               <displayName>BRR</displayName>
               <description>Baud rate register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BRR</name>
                     <description>BRR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RQR</name>
               <displayName>RQR</displayName>
               <description>Request register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>TXFRQ</name>
                     <description>TXFRQ</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFRQ</name>
                     <description>Receive data flush request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MMRQ</name>
                     <description>Mute mode request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBKRQ</name>
                     <description>Send break request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
