rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>COMP_C6CSR</name>
               <displayName>COMP_C6CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x214</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP_DEGLITCH_EN</name>
                     <description>COMP_DEGLITCH_EN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP_C7CSR</name>
               <displayName>COMP_C7CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x218</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP_DEGLITCH_EN</name>
                     <description>COMP_DEGLITCH_EN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMP1_CSR</name>
               <displayName>OPAMP1_CSR</displayName>
               <description>OPAMP1 control/status register</description>
               <addressOffset>0x300</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMP2_CSR</name>
               <displayName>OPAMP2_CSR</displayName>
               <description>OPAMP2 control/status register</description>
               <addressOffset>0x304</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMP3_CSR</name>
               <displayName>OPAMP3_CSR</displayName>
               <description>OPAMP3 control/status register</description>
               <addressOffset>0x308</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMP4_CSR</name>
               <displayName>OPAMP4_CSR</displayName>
               <description>OPAMP4 control/status register</description>
               <addressOffset>0x30C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OPAEN</name>
                     <description>Operational amplifier               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCE_VP</name>
                     <description>FORCE_VP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VP_SEL</name>
                     <description>VP_SEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USERTRIM</name>
                     <description>USERTRIM</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VM_SEL</name>
                     <description>VM_SEL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OPAHSM</name>
                     <description>OPAHSM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAINTOEN</name>
                     <description>OPAINTOEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALON</name>
                     <description>CALON</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALSEL</name>
                     <description>CALSEL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PGA_GAIN</name>
                     <description>PGA_GAIN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETP</name>
                     <description>TRIMOFFSETP</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOFFSETN</name>
                     <description>TRIMOFFSETN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CALOUT</name>
                     <description>CALOUT</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
