rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>ADC4R</name>
               <displayName>ADC4R</displayName>
               <description>ADC Trigger 4 Register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AD2TERST</name>
                     <description>AD2TERST</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TEC4</name>
                     <description>AD2TEC4</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TEC3</name>
                     <description>AD2TEC3</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TEC2</name>
                     <description>AD2TEC2</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TDRST</name>
                     <description>AD2TDRST</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TDPER</name>
                     <description>AD2TDPER</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TDC4</name>
                     <description>AD2TDC4</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TDC3</name>
                     <description>AD2TDC3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TDC2</name>
                     <description>AD2TDC2</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TCRST</name>
                     <description>AD2TCRST</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TCPER</name>
                     <description>AD2TCPER</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TCC4</name>
                     <description>AD2TCC4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TCC3</name>
                     <description>AD2TCC3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TCC2</name>
                     <description>AD2TCC2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TBPER</name>
                     <description>AD2TBPER</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TBC4</name>
                     <description>AD2TBC4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TBC3</name>
                     <description>AD2TBC3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TBC2</name>
                     <description>AD2TBC2</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TAPER</name>
                     <description>AD2TAPER</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TAC4</name>
                     <description>AD2TAC4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TAC3</name>
                     <description>AD2TAC3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2TAC2</name>
                     <description>AD2TAC2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2EEV10</name>
                     <description>AD2EEV10</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2EEV9</name>
                     <description>AD2EEV9</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2EEV8</name>
                     <description>AD2EEV8</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2EEV7</name>
                     <description>AD2EEV7</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2EEV6</name>
                     <description>AD2EEV6</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2MPER</name>
                     <description>AD2MPER</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2MC4</name>
                     <description>AD2MC4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2MC3</name>
                     <description>AD2MC3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2MC2</name>
                     <description>AD2MC2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD2MC1</name>
                     <description>AD2MC1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DLLCR</name>
               <displayName>DLLCR</displayName>
               <description>DLL Control Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALRTE</name>
                     <description>DLL Calibration rate</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CALEN</name>
                     <description>DLL Calibration Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAL</name>
                     <description>DLL Calibration Start</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTINR1</name>
               <displayName>FLTINR1</displayName>
               <description>HRTIM Fault Input Register 1</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT4LCK</name>
                     <description>FLT4LCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4F</name>
                     <description>FLT4F</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT4SRC</name>
                     <description>FLT4SRC</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4P</name>
                     <description>FLT4P</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4E</name>
                     <description>FLT4E</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3LCK</name>
                     <description>FLT3LCK</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3F</name>
                     <description>FLT3F</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT3SRC</name>
                     <description>FLT3SRC</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3P</name>
                     <description>FLT3P</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3E</name>
                     <description>FLT3E</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2LCK</name>
                     <description>FLT2LCK</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2F</name>
                     <description>FLT2F</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT2SRC</name>
                     <description>FLT2SRC</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2P</name>
                     <description>FLT2P</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2E</name>
                     <description>FLT2E</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1LCK</name>
                     <description>FLT1LCK</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1F</name>
                     <description>FLT1F</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT1SRC</name>
                     <description>FLT1SRC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1P</name>
                     <description>FLT1P</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1E</name>
                     <description>FLT1E</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTINR2</name>
               <displayName>FLTINR2</displayName>
               <description>HRTIM Fault Input Register 2</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLTSD</name>
                     <description>FLTSD</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FLT6SRC_1</name>
                     <description>FLT6SRC</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5SRC_1</name>
                     <description>FLT5SRC_1</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4SRC_1</name>
                     <description>FLT4SRC_1</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3SRC_1</name>
                     <description>FLT3SRC_1</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2SRC_1</name>
                     <description>FLT2SRC_1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1SRC_1</name>
                     <description>FLT1SRC_1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6LCK</name>
                     <description>FLT6LCK</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6F</name>
                     <description>FLT6F</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT6SRC_0</name>
                     <description>FLT6F</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6P</name>
                     <description>FLT6P</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6E</name>
                     <description>FLT6E</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5LCK</name>
                     <description>FLT5LCK</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5F</name>
                     <description>FLT5F</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT5SRC</name>
                     <description>FLT5SRC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5P</name>
                     <description>FLT5P</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5E</name>
                     <description>FLT5E</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDMUPDR</name>
               <displayName>BDMUPDR</displayName>
               <description>BDMUPDR</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCMP4</name>
                     <description>MCMP4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCMP3</name>
                     <description>MCMP3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCMP2</name>
                     <description>MCMP2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCMP1</name>
                     <description>MCMP1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MREP</name>
                     <description>MREP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MPER</name>
                     <description>MPER</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>MCNT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MDIER</name>
                     <description>MDIER</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MICR</name>
                     <description>MICR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCR</name>
                     <description>MCR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
