rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>ADCUR</name>
               <displayName>ADCUR</displayName>
               <description>HRTIM ADC Trigger Update           Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AD10USRC</name>
                     <description>AD10USRC</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AD9USRC</name>
                     <description>AD9USRC</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AD8USRC</name>
                     <description>AD8USRC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AD7USRC</name>
                     <description>AD7USRC</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AD6USRC</name>
                     <description>AD6USRC</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AD5USRC</name>
                     <description>AD5USRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCPS1</name>
               <displayName>ADCPS1</displayName>
               <description>HRTIM ADC Post Scaler Register           1</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC5PSC</name>
                     <description>ADC5PSC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC4PSC</name>
                     <description>ADC4PSC</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC3PSC</name>
                     <description>ADC3PSC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC2PSC</name>
                     <description>ADC2PSC</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC1PSC</name>
                     <description>ADC1PSC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCPS2</name>
               <displayName>ADCPS2</displayName>
               <description>HRTIM ADC Post Scaler Register           2</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC10PSC</name>
                     <description>ADC10PSC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC9PSC</name>
                     <description>ADC9PSC</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC8PSC</name>
                     <description>ADC8PSC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC7PSC</name>
                     <description>ADC7PSC</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC6PSC</name>
                     <description>ADC6PSC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTINR3</name>
               <displayName>FLTINR3</displayName>
               <description>HRTIM Fault Input Register 3</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT4RSTM</name>
                     <description>FLT4RSTM</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4CRES</name>
                     <description>FLT4CRES</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4CNT</name>
                     <description>FLT4CNT</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT4BLKS</name>
                     <description>FLT4BLKS</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT4BLKE</name>
                     <description>FLT4BLKE</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3RSTM</name>
                     <description>FLT3RSTM</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3CRES</name>
                     <description>FLT3CRES</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3CNT</name>
                     <description>FLT3CNT</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT3BLKS</name>
                     <description>FLT3BLKS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT3BLKE</name>
                     <description>FLT3BLKE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2RSTM</name>
                     <description>FLT2RSTM</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2CRES</name>
                     <description>FLT2CRES</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2CNT</name>
                     <description>FLT2CNT</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT2BLKS</name>
                     <description>FLT2BLKS</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT2BLKE</name>
                     <description>FLT2BLKE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1RSTM</name>
                     <description>FLT1RSTM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1CRES</name>
                     <description>FLT1CRES</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1CNT</name>
                     <description>FLT1CNT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT1BLKS</name>
                     <description>FLT1BLKS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT1BLKE</name>
                     <description>FLT1BLKE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLTINR4</name>
               <displayName>FLTINR4</displayName>
               <description>HRTIM Fault Input Register 4</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FLT6RSTM</name>
                     <description>FLT6RSTM</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6CRES</name>
                     <description>FLT6CRES</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6CNT</name>
                     <description>FLT6CNT</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT6BLKS</name>
                     <description>FLT6BLKS</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT6BLKE</name>
                     <description>FLT6BLKE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5RSTM</name>
                     <description>FLT5RSTM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5CRES</name>
                     <description>FLT5CRES</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5CNT</name>
                     <description>FLT5CNT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT5BLKS</name>
                     <description>FLT5BLKS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLT5BLKE</name>
                     <description>FLT5BLKE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
