rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DAC1</name>
         <description>Digital-to-analog converter</description>
         <groupName>DAC</groupName>
         <baseAddress>0x50000800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DAC_CR</name>
               <displayName>DAC_CR</displayName>
               <description>DAC control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN1</name>
                     <description>DAC channel1 enable This bit is set and               cleared by software to enable/disable DAC               channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEN1</name>
                     <description>DAC channel1 trigger               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSEL1</name>
                     <description>DAC channel1 trigger selection These               bits select the external event used to trigger DAC               channel1. Note: Only used if bit TEN1 = 1 (DAC               channel1 trigger enabled).</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WAVE1</name>
                     <description>DAC channel1 noise/triangle wave               generation enable These bits are set and cleared by               software. Note: Only used if bit TEN1 = 1 (DAC               channel1 trigger enabled).</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MAMP1</name>
                     <description>DAC channel1 mask/amplitude selector               These bits are written by software to select mask in               wave generation mode or amplitude in triangle               generation mode. = 1011: Unmask bits[11:0] of LFSR/               triangle amplitude equal to 4095</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN1</name>
                     <description>DAC channel1 DMA enable This bit is set               and cleared by software.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAUDRIE1</name>
                     <description>DAC channel1 DMA Underrun Interrupt               enable This bit is set and cleared by               software.</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN1</name>
                     <description>DAC Channel 1 calibration enable This               bit is set and cleared by software to enable/disable               DAC channel 1 calibration, it can be written only if               bit EN1=0 into DAC_CR (the calibration mode can be               entered/exit only when the DAC channel is disabled)               Otherwise, the write operation is               ignored.</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN2</name>
                     <description>DAC channel2 enable This bit is set and               cleared by software to enable/disable DAC               channel2.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEN2</name>
                     <description>DAC channel2 trigger               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSEL2</name>
                     <description>DAC channel2 trigger selection These               bits select the external event used to trigger DAC               channel2 Note: Only used if bit TEN2 = 1 (DAC               channel2 trigger enabled).</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>WAVE2</name>
                     <description>DAC channel2 noise/triangle wave               generation enable These bits are set/reset by               software. 1x: Triangle wave generation enabled Note:               Only used if bit TEN2 = 1 (DAC channel2 trigger               enabled)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MAMP2</name>
                     <description>DAC channel2 mask/amplitude selector               These bits are written by software to select mask in               wave generation mode or amplitude in triangle               generation mode. = 1011: Unmask bits[11:0] of LFSR/               triangle amplitude equal to 4095</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN2</name>
                     <description>DAC channel2 DMA enable This bit is set               and cleared by software.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAUDRIE2</name>
                     <description>DAC channel2 DMA underrun interrupt               enable This bit is set and cleared by               software.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN2</name>
                     <description>DAC Channel 2 calibration enable This               bit is set and cleared by software to enable/disable               DAC channel 2 calibration, it can be written only if               bit EN2=0 into DAC_CR (the calibration mode can be               entered/exit only when the DAC channel is disabled)               Otherwise, the write operation is               ignored.</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_SWTRGR</name>
               <displayName>DAC_SWTRGR</displayName>
               <description>DAC software trigger register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWTRIG1</name>
                     <description>DAC channel1 software trigger This bit               is set by software to trigger the DAC in software               trigger mode. Note: This bit is cleared by hardware               (one APB1 clock cycle later) once the DAC_DHR1               register value has been loaded into the DAC_DOR1               register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG2</name>
                     <description>DAC channel2 software trigger This bit               is set by software to trigger the DAC in software               trigger mode. Note: This bit is cleared by hardware               (one APB1 clock cycle later) once the DAC_DHR2               register value has been loaded into the DAC_DOR2               register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIGB1</name>
                     <description>DAC channel1 software trigger               B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIGB2</name>
                     <description>DAC channel2 software trigger               B</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12R1</name>
               <displayName>DAC_DHR12R1</displayName>
               <description>DAC channel1 12-bit right-aligned data           holding register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit right-aligned data               These bits are written by software which specifies               12-bit data for DAC channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC1DHRB</name>
                     <description>DAC channel1 12-bit right-aligned data               B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12L1</name>
               <displayName>DAC_DHR12L1</displayName>
               <description>DAC channel1 12-bit left aligned data           holding register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit left-aligned data               These bits are written by software which specifies               12-bit data for DAC channel1.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC1DHRB</name>
                     <description>DAC channel1 12-bit left-aligned data               B</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR8R1</name>
               <displayName>DAC_DHR8R1</displayName>
               <description>DAC channel1 8-bit right aligned data           holding register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 8-bit right-aligned data               These bits are written by software which specifies               8-bit data for DAC channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DACC1DHRB</name>
                     <description>DAC channel1 8-bit right-aligned               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12R2</name>
               <displayName>DAC_DHR12R2</displayName>
               <description>DAC channel2 12-bit right aligned data           holding register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 12-bit right-aligned data               These bits are written by software which specifies               12-bit data for DAC channel2.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHRB</name>
                     <description>DAC channel2 12-bit right-aligned               data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12L2</name>
               <displayName>DAC_DHR12L2</displayName>
               <description>DAC channel2 12-bit left aligned data           holding register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 12-bit left-aligned data               These bits are written by software which specify               12-bit data for DAC channel2.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHRB</name>
                     <description>DAC channel2 12-bit left-aligned data               B</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR8R2</name>
               <displayName>DAC_DHR8R2</displayName>
               <description>DAC channel2 8-bit right-aligned data           holding register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 8-bit right-aligned data               These bits are written by software which specifies               8-bit data for DAC channel2.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHRB</name>
                     <description>DAC channel2 8-bit right-aligned               data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12RD</name>
               <displayName>DAC_DHR12RD</displayName>
               <description>Dual DAC 12-bit right-aligned data holding           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit right-aligned data               These bits are written by software which specifies               12-bit data for DAC channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 12-bit right-aligned data               These bits are written by software which specifies               12-bit data for DAC channel2.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR12LD</name>
               <displayName>DAC_DHR12LD</displayName>
               <description>DUAL DAC 12-bit left aligned data holding           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 12-bit left-aligned data               These bits are written by software which specifies               12-bit data for DAC channel1.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 12-bit left-aligned data               These bits are written by software which specifies               12-bit data for DAC channel2.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DHR8RD</name>
               <displayName>DAC_DHR8RD</displayName>
               <description>DUAL DAC 8-bit right aligned data holding           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DHR</name>
                     <description>DAC channel1 8-bit right-aligned data               These bits are written by software which specifies               8-bit data for DAC channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DHR</name>
                     <description>DAC channel2 8-bit right-aligned data               These bits are written by software which specifies               8-bit data for DAC channel2.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DOR1</name>
               <displayName>DAC_DOR1</displayName>
               <description>DAC channel1 data output           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC1DOR</name>
                     <description>DAC channel1 data output These bits are               read-only, they contain data output for DAC               channel1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC1DORB</name>
                     <description>DAC channel1 data output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DAC_DOR2</name>
               <displayName>DAC_DOR2</displayName>
               <description>DAC channel2 data output           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACC2DOR</name>
                     <description>DAC channel2 data output These bits are               read-only, they contain data output for DAC               channel2.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DACC2DORB</name>
                     <description>DAC channel2 data output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
