rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DAC1">
         <name>DAC2</name>
         <baseAddress>0x50000C00</baseAddress>
      </peripheral>
      <peripheral derivedFrom="DAC1">
         <name>DAC3</name>
         <baseAddress>0x50001000</baseAddress>
      </peripheral>
      <peripheral derivedFrom="DAC1">
         <name>DAC4</name>
         <baseAddress>0x50001400</baseAddress>
      </peripheral>
      <peripheral>
         <name>ADC1</name>
         <description>Analog-to-Digital Converter</description>
         <groupName>ADC</groupName>
         <baseAddress>0x50000000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC1_2</name>
            <description>ADC1 and ADC2 global interrupt</description>
            <value>18</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>interrupt and status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVF</name>
                     <description>JQOVF</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3</name>
                     <description>AWD3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2</name>
                     <description>AWD2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1</name>
                     <description>AWD1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOS</name>
                     <description>JEOS</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOC</name>
                     <description>JEOC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>OVR</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOS</name>
                     <description>EOS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC</name>
                     <description>EOC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMP</name>
                     <description>EOSMP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDY</name>
                     <description>ADRDY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>interrupt enable register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVFIE</name>
                     <description>JQOVFIE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3IE</name>
                     <description>AWD3IE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2IE</name>
                     <description>AWD2IE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1IE</name>
                     <description>AWD1IE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOSIE</name>
                     <description>JEOSIE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOCIE</name>
                     <description>JEOCIE</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRIE</name>
                     <description>OVRIE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSIE</name>
                     <description>EOSIE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOCIE</name>
                     <description>EOCIE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMPIE</name>
                     <description>EOSMPIE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDYIE</name>
                     <description>ADRDYIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20000000</resetValue>
               <fields>
                  <field>
                     <name>ADCAL</name>
                     <description>ADCAL</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCALDIF</name>
                     <description>ADCALDIF</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEEPPWD</name>
                     <description>DEEPPWD</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADVREGEN</name>
                     <description>ADVREGEN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTP</name>
                     <description>JADSTP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTP</name>
                     <description>ADSTP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTART</name>
                     <description>JADSTART</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTART</name>
                     <description>ADSTART</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIS</name>
                     <description>ADDIS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADEN</name>
                     <description>ADEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>JQDIS</name>
                     <description>Injected Queue disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH1CH</name>
                     <description>AWDCH1CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JAUTO</name>
                     <description>JAUTO</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JAWD1EN</name>
                     <description>JAWD1EN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1EN</name>
                     <description>AWD1EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1SGL</name>
                     <description>AWD1SGL</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JQM</name>
                     <description>JQM</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDISCEN</name>
                     <description>JDISCEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCNUM</name>
                     <description>DISCNUM</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DISCEN</name>
                     <description>DISCEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALIGN</name>
                     <description>ALIGN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTDLY</name>
                     <description>AUTDLY</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>CONT</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRMOD</name>
                     <description>OVRMOD</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEN</name>
                     <description>EXTEN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EXTSEL</name>
                     <description>EXTSEL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ALIGN_5</name>
                     <description>ALIGN_5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES</name>
                     <description>RES</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMACFG</name>
                     <description>DMACFG</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMAEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>configuration register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPTRIG</name>
                     <description>SMPTRIG</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BULB</name>
                     <description>BULB</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG</name>
                     <description>SWTRIG</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCOMP</name>
                     <description>GCOMP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVSM</name>
                     <description>EXTEN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TROVS</name>
                     <description>Triggered Regular               Oversampling</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVSS</name>
                     <description>ALIGN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OVSR</name>
                     <description>RES</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JOVSE</name>
                     <description>DMACFG</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVSE</name>
                     <description>DMAEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPR1</name>
               <displayName>SMPR1</displayName>
               <description>sample time register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMP9</name>
                     <description>SMP9</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP8</name>
                     <description>SMP8</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP7</name>
                     <description>SMP7</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP6</name>
                     <description>SMP6</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP5</name>
                     <description>SMP5</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP4</name>
                     <description>SMP4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP3</name>
                     <description>SMP3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP2</name>
                     <description>SMP2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP1</name>
                     <description>SMP1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMPPLUS</name>
                     <description>Addition of one clock cycle to the               sampling time</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMP0</name>
                     <description>SMP0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
