rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>AWD2CR</name>
               <displayName>AWD2CR</displayName>
               <description>Analog Watchdog 2 Configuration           Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD2CH</name>
                     <description>AWD2CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD3CR</name>
               <displayName>AWD3CR</displayName>
               <description>Analog Watchdog 3 Configuration           Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD3CH</name>
                     <description>AWD3CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIFSEL</name>
               <displayName>DIFSEL</displayName>
               <description>Differential Mode Selection Register           2</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIFSEL_0</name>
                     <description>Differential mode for channels               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DIFSEL_1_18</name>
                     <description>Differential mode for channels 15 to               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALFACT</name>
               <displayName>CALFACT</displayName>
               <description>Calibration Factors</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALFACT_D</name>
                     <description>CALFACT_D</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CALFACT_S</name>
                     <description>CALFACT_S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCOMP</name>
               <displayName>GCOMP</displayName>
               <description>Gain compensation Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GCOMPCOEFF</name>
                     <description>GCOMPCOEFF</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="ADC1">
         <name>ADC2</name>
         <baseAddress>0x50000100</baseAddress>
      </peripheral>
      <peripheral derivedFrom="ADC1">
         <name>ADC4</name>
         <baseAddress>0x500005FC</baseAddress>
         <interrupt>
            <name>ADC4</name>
            <description>ADC4</description>
            <value>61</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>ADC3</name>
         <description>Analog-to-Digital Converter</description>
         <groupName>ADC</groupName>
         <baseAddress>0x500004FC</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC3</name>
            <description>ADC3</description>
            <value>47</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>interrupt and status register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVF</name>
                     <description>JQOVF</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3</name>
                     <description>AWD3</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2</name>
                     <description>AWD2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1</name>
                     <description>AWD1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOS</name>
                     <description>JEOS</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOC</name>
                     <description>JEOC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>OVR</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOS</name>
                     <description>EOS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC</name>
                     <description>EOC</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMP</name>
                     <description>EOSMP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDY</name>
                     <description>ADRDY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>interrupt enable register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVFIE</name>
                     <description>JQOVFIE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3IE</name>
                     <description>AWD3IE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2IE</name>
                     <description>AWD2IE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1IE</name>
                     <description>AWD1IE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOSIE</name>
                     <description>JEOSIE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOCIE</name>
                     <description>JEOCIE</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRIE</name>
                     <description>OVRIE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSIE</name>
                     <description>EOSIE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOCIE</name>
                     <description>EOCIE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMPIE</name>
                     <description>EOSMPIE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDYIE</name>
                     <description>ADRDYIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x20002000</resetValue>
               <fields>
                  <field>
                     <name>ADCAL</name>
                     <description>ADCAL</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCALDIF</name>
                     <description>ADCALDIF</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEEPPWD</name>
                     <description>DEEPPWD</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADVREGEN</name>
                     <description>ADVREGEN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTP</name>
                     <description>JADSTP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTP</name>
                     <description>ADSTP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTART</name>
                     <description>JADSTART</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTART</name>
                     <description>ADSTART</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIS</name>
                     <description>ADDIS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADEN</name>
                     <description>ADEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>JQDIS</name>
                     <description>Injected Queue disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH1CH</name>
                     <description>AWDCH1CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JAUTO</name>
                     <description>JAUTO</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JAWD1EN</name>
                     <description>JAWD1EN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1EN</name>
                     <description>AWD1EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1SGL</name>
                     <description>AWD1SGL</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JQM</name>
                     <description>JQM</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDISCEN</name>
                     <description>JDISCEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCNUM</name>
                     <description>DISCNUM</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DISCEN</name>
                     <description>DISCEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALIGN</name>
                     <description>ALIGN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTDLY</name>
                     <description>AUTDLY</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>CONT</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRMOD</name>
                     <description>OVRMOD</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEN</name>
                     <description>EXTEN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EXTSEL</name>
                     <description>EXTSEL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ALIGN_5</name>
                     <description>ALIGN_5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES</name>
                     <description>RES</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMACFG</name>
                     <description>DMACFG</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMAEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>configuration register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPTRIG</name>
                     <description>SMPTRIG</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BULB</name>
                     <description>BULB</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG</name>
                     <description>SWTRIG</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCOMP</name>
                     <description>GCOMP</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVSM</name>
                     <description>EXTEN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TROVS</name>
                     <description>Triggered Regular               Oversampling</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVSS</name>
                     <description>ALIGN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OVSR</name>
                     <description>RES</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JOVSE</name>
                     <description>DMACFG</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVSE</name>
                     <description>DMAEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
