rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>OFR4</name>
               <displayName>OFR4</displayName>
               <description>offset register 4</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>OFFSET1_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>OFFSET1_CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SATEN</name>
                     <description>SATEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETPOS</name>
                     <description>OFFSETPOS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>OFFSET1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR1</name>
               <displayName>JDR1</displayName>
               <description>injected data register 1</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA1</name>
                     <description>JDATA1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR2</name>
               <displayName>JDR2</displayName>
               <description>injected data register 2</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA2</name>
                     <description>JDATA2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR3</name>
               <displayName>JDR3</displayName>
               <description>injected data register 3</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA3</name>
                     <description>JDATA3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR4</name>
               <displayName>JDR4</displayName>
               <description>injected data register 4</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA4</name>
                     <description>JDATA4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD2CR</name>
               <displayName>AWD2CR</displayName>
               <description>Analog Watchdog 2 Configuration           Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD2CH</name>
                     <description>AWD2CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD3CR</name>
               <displayName>AWD3CR</displayName>
               <description>Analog Watchdog 3 Configuration           Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD3CH</name>
                     <description>AWD3CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIFSEL</name>
               <displayName>DIFSEL</displayName>
               <description>Differential Mode Selection Register           2</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIFSEL_0</name>
                     <description>Differential mode for channels               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DIFSEL_1_18</name>
                     <description>Differential mode for channels 15 to               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALFACT</name>
               <displayName>CALFACT</displayName>
               <description>Calibration Factors</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALFACT_D</name>
                     <description>CALFACT_D</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CALFACT_S</name>
                     <description>CALFACT_S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCOMP</name>
               <displayName>GCOMP</displayName>
               <description>Gain compensation Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GCOMPCOEFF</name>
                     <description>GCOMPCOEFF</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
