rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="ADC12_Common">
         <name>ADC345_Common</name>
         <baseAddress>0x50000314</baseAddress>
      </peripheral>
      <peripheral>
         <name>FMAC</name>
         <description>Filter Math Accelerator</description>
         <groupName>FMAC</groupName>
         <baseAddress>0x40021400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xC00</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FMAC</name>
            <description>FMAC</description>
            <value>101</value>
         </interrupt>
         <registers>
            <register>
               <name>X1BUFCFG</name>
               <displayName>X1BUFCFG</displayName>
               <description>FMAC X1 Buffer Configuration           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>X1_BASE</name>
                     <description>X1_BASE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>X1_BUF_SIZE</name>
                     <description>X1_BUF_SIZE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FULL_WM</name>
                     <description>FULL_WM</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>X2BUFCFG</name>
               <displayName>X2BUFCFG</displayName>
               <description>FMAC X2 Buffer Configuration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>X2_BASE</name>
                     <description>X1_BASE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>X2_BUF_SIZE</name>
                     <description>X1_BUF_SIZE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>YBUFCFG</name>
               <displayName>YBUFCFG</displayName>
               <description>FMAC Y Buffer Configuration           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Y_BASE</name>
                     <description>X1_BASE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Y_BUF_SIZE</name>
                     <description>X1_BUF_SIZE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>EMPTY_WM</name>
                     <description>EMPTY_WM</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <displayName>PARAM</displayName>
               <description>FMAC Parameter register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>START</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUNC</name>
                     <description>FUNC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>R</name>
                     <description>R</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Q</name>
                     <description>Q</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>P</name>
                     <description>P</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>FMAC Control register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>RESET</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLIPEN</name>
                     <description>CLIPEN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAWEN</name>
                     <description>DMAWEN</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREN</name>
                     <description>DMAREN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SATIEN</name>
                     <description>SATIEN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNFLIEN</name>
                     <description>UNFLIEN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVFLIEN</name>
                     <description>OVFLIEN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WIEN</name>
                     <description>WIEN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIEN</name>
                     <description>RIEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>FMAC Status register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>YEMPTY</name>
                     <description>YEMPTY</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>X1FULL</name>
                     <description>X1FULL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVFL</name>
                     <description>OVFL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNFL</name>
                     <description>UNFL</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAT</name>
                     <description>SAT</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDATA</name>
               <displayName>WDATA</displayName>
               <description>FMAC Write Data register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>WDATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDATA</name>
               <displayName>RDATA</displayName>
               <description>FMAC Read Data register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATA</name>
                     <description>RDATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
