rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>STK</name>
         <description>SysTick timer</description>
         <groupName>STK</groupName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <displayName>CTRL</displayName>
               <description>SysTick control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Counter enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick exception request               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock source selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>COUNTFLAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOAD</name>
               <displayName>LOAD</displayName>
               <description>SysTick reload value register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL</name>
               <displayName>VAL</displayName>
               <description>SysTick current value register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <displayName>CALIB</displayName>
               <description>SysTick calibration value           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00000000</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Calibration value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>SKEW flag: Indicates whether the TENMS               value is exact</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>NOREF flag. Reads as zero</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCB</name>
         <description>System control block</description>
         <groupName>SCB</groupName>
         <baseAddress>0xE000ED00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x41</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CPUID</name>
               <displayName>CPUID</displayName>
               <description>CPUID base register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x410FC241</resetValue>
               <fields>
                  <field>
                     <name>Revision</name>
                     <description>Revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PartNo</name>
                     <description>Part number of the               processor</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>Constant</name>
                     <description>Reads as 0xF</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>Variant</name>
                     <description>Variant number</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>Implementer</name>
                     <description>Implementer code</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICSR</name>
               <displayName>ICSR</displayName>
               <description>Interrupt control and state           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VECTACTIVE</name>
                     <description>Active vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RETTOBASE</name>
                     <description>Return to base level</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VECTPENDING</name>
                     <description>Pending vector</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ISRPENDING</name>
                     <description>Interrupt pending flag</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSTCLR</name>
                     <description>SysTick exception clear-pending               bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSTSET</name>
                     <description>SysTick exception set-pending               bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSVCLR</name>
                     <description>PendSV clear-pending bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSVSET</name>
                     <description>PendSV set-pending bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMIPENDSET</name>
                     <description>NMI set-pending bit.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VTOR</name>
               <displayName>VTOR</displayName>
               <description>Vector table offset register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBLOFF</name>
                     <description>Vector table base offset               field</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>21</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AIRCR</name>
               <displayName>AIRCR</displayName>
               <description>Application interrupt and reset control           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VECTRESET</name>
                     <description>VECTRESET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VECTCLRACTIVE</name>
                     <description>VECTCLRACTIVE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSRESETREQ</name>
                     <description>SYSRESETREQ</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIGROUP</name>
                     <description>PRIGROUP</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ENDIANESS</name>
                     <description>ENDIANESS</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VECTKEYSTAT</name>
                     <description>Register key</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <displayName>SCR</displayName>
               <description>System control register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLEEPONEXIT</name>
                     <description>SLEEPONEXIT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEPDEEP</name>
                     <description>SLEEPDEEP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SEVEONPEND</name>
                     <description>Send Event on Pending bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>Configuration and control           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NONBASETHRDENA</name>
                     <description>Configures how the processor enters               Thread mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USERSETMPEND</name>
                     <description>USERSETMPEND</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNALIGN__TRP</name>
                     <description>UNALIGN_ TRP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIV_0_TRP</name>
                     <description>DIV_0_TRP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BFHFNMIGN</name>
                     <description>BFHFNMIGN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STKALIGN</name>
                     <description>STKALIGN</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR1</name>
               <displayName>SHPR1</displayName>
               <description>System handler priority           registers</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRI_4</name>
                     <description>Priority of system handler               4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_5</name>
                     <description>Priority of system handler               5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_6</name>
                     <description>Priority of system handler               6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR2</name>
               <displayName>SHPR2</displayName>
               <description>System handler priority           registers</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRI_11</name>
                     <description>Priority of system handler               11</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR3</name>
               <displayName>SHPR3</displayName>
               <description>System handler priority           registers</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRI_14</name>
                     <description>Priority of system handler               14</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_15</name>
                     <description>Priority of system handler               15</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHCRS</name>
               <displayName>SHCRS</displayName>
               <description>System handler control and state           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEMFAULTACT</name>
                     <description>Memory management fault exception active               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSFAULTACT</name>
                     <description>Bus fault exception active               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USGFAULTACT</name>
                     <description>Usage fault exception active               bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVCALLACT</name>
                     <description>SVC call active bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MONITORACT</name>
                     <description>Debug monitor active bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PENDSVACT</name>
                     <description>PendSV exception active               bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSTICKACT</name>
                     <description>SysTick exception active               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USGFAULTPENDED</name>
                     <description>Usage fault exception pending               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEMFAULTPENDED</name>
                     <description>Memory management fault exception               pending bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSFAULTPENDED</name>
                     <description>Bus fault exception pending               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVCALLPENDED</name>
                     <description>SVC call pending bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEMFAULTENA</name>
                     <description>Memory management fault enable               bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSFAULTENA</name>
                     <description>Bus fault enable bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USGFAULTENA</name>
                     <description>Usage fault enable bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
