rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>FDCAN_ILS</name>
               <displayName>FDCAN_ILS</displayName>
               <description>The Interrupt Line Select register assigns           an interrupt generated by a specific interrupt flag from           the Interrupt Register to one of the two module interrupt           lines. For interrupt generation the respective interrupt           line has to be enabled via ILE[EINT0] and           ILE[EINT1].</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RF0NL</name>
                     <description>RF0NL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0WL</name>
                     <description>RF0WL</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0FL</name>
                     <description>RF0FL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0LL</name>
                     <description>RF0LL</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1NL</name>
                     <description>RF1NL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1WL</name>
                     <description>RF1WL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1FL</name>
                     <description>RF1FL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1LL</name>
                     <description>RF1LL</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HPML</name>
                     <description>HPML</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCL</name>
                     <description>TCL</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCFL</name>
                     <description>TCFL</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFEL</name>
                     <description>TFEL</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFNL</name>
                     <description>TEFNL</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFWL</name>
                     <description>TEFWL</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFFL</name>
                     <description>TEFFL</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFLL</name>
                     <description>TEFLL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSWL</name>
                     <description>TSWL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRAFL</name>
                     <description>MRAFL</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOOL</name>
                     <description>TOOL</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRXL</name>
                     <description>DRXL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BECL</name>
                     <description>BECL</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BEUL</name>
                     <description>BEUL</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ELOL</name>
                     <description>ELOL</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPL</name>
                     <description>EPL</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWL</name>
                     <description>EWL</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOL</name>
                     <description>BOL</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDIL</name>
                     <description>WDIL</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEAL</name>
                     <description>PEAL</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEDL</name>
                     <description>PEDL</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARAL</name>
                     <description>ARAL</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_ILE</name>
               <displayName>FDCAN_ILE</displayName>
               <description>Each of the two interrupt lines to the CPU           can be enabled/disabled separately by programming bits           EINT0 and EINT1.</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EINT0</name>
                     <description>EINT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EINT1</name>
                     <description>EINT1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_RXGFC</name>
               <displayName>FDCAN_RXGFC</displayName>
               <description>Global settings for Message ID filtering.           The Global Filter Configuration controls the filter path           for standard and extended messages as described in           Figure706: Standard Message ID filter path and Figure707:           Extended Message ID filter path.</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RRFE</name>
                     <description>RRFE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RRFS</name>
                     <description>RRFS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ANFE</name>
                     <description>ANFE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>ANFS</name>
                     <description>ANFS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_XIDAM</name>
               <displayName>FDCAN_XIDAM</displayName>
               <description>FDCAN Extended ID and Mask   Register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x1FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>EIDM</name>
                     <description>EIDM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_HPMS</name>
               <displayName>FDCAN_HPMS</displayName>
               <description>This register is updated every time a    Message ID filter element configured to generate a    priority event match. This can be used to monitor the    status of incoming high priority messages and to enable           fast access to these messages.</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BIDX</name>
                     <description>BIDX</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>MSI</name>
                     <description>MSI</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FIDX</name>
                     <description>FIDX</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FLST</name>
                     <description>FLST</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_RXF0S</name>
               <displayName>FDCAN_RXF0S</displayName>
               <description>FDCAN Rx FIFO 0 Status Register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0FL</name>
                     <description>F0FL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F0GI</name>
                     <description>F0GI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F0PI</name>
                     <description>F0PI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F0F</name>
                     <description>F0F</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0L</name>
                     <description>RF0L</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_RXF0A</name>
               <displayName>FDCAN_RXF0A</displayName>
               <description>CAN Rx FIFO 0 Acknowledge Register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0AI</name>
                     <description>F0AI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_RXF1S</name>
               <displayName>FDCAN_RXF1S</displayName>
               <description>FDCAN Rx FIFO 1 Status  Register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1FL</name>
                     <description>F1FL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1GI</name>
                     <description>F1GI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1PI</name>
                     <description>F1PI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1F</name>
                     <description>F1F</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>RF1L</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMS</name>
                     <description>DMS</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_RXF1A</name>
               <displayName>FDCAN_RXF1A</displayName>
               <description>FDCAN Rx FIFO 1 Acknowledge Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1AI</name>
                     <description>F1AI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBC</name>
               <displayName>FDCAN_TXBC</displayName>
               <description>FDCAN Tx Buffer Configuration  Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBSA</name>
                     <description>TBSA</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>NDTB</name>
                     <description>NDTB</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQS</name>
                     <description>TFQS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQM</name>
                     <description>TFQM</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXFQS</name>
               <displayName>FDCAN_TXFQS</displayName>
               <description>The Tx FIFO/Queue status is related to the    pending Tx requests listed in register TXBRP. Therefore     the effect of Add/Cancellation requests may be delayed   due to a running Tx scan (TXBRP not yet           updated).</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>TFFL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>TFGI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>TFQPI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>TFQF</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBRP</name>
               <displayName>FDCAN_TXBRP</displayName>
               <description>FDCAN Tx Buffer Request Pending           Register</description>
               <addressOffset>0xC8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRP</name>
                     <description>TRP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBAR</name>
               <displayName>FDCAN_TXBAR</displayName>
               <description>FDCAN Tx Buffer Add Request           Register</description>
               <addressOffset>0xCC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AR</name>
                     <description>AR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBCR</name>
               <displayName>FDCAN_TXBCR</displayName>
               <description>FDCAN Tx Buffer Cancellation Request           Register</description>
               <addressOffset>0xD0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CR</name>
                     <description>CR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
