rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>FDCAN_TXBTO</name>
               <displayName>FDCAN_TXBTO</displayName>
               <description>FDCAN Tx Buffer Transmission Occurred           Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TO</name>
                     <description>TO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBCF</name>
               <displayName>FDCAN_TXBCF</displayName>
               <description>FDCAN Tx Buffer Cancellation Finished           Register</description>
               <addressOffset>0xD8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CF</name>
                     <description>CF</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBTIE</name>
               <displayName>FDCAN_TXBTIE</displayName>
               <description>FDCAN Tx Buffer Transmission Interrupt           Enable Register</description>
               <addressOffset>0xDC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIE</name>
                     <description>TIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXBCIE</name>
               <displayName>FDCAN_TXBCIE</displayName>
               <description>FDCAN Tx Buffer Cancellation Finished           Interrupt Enable Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFIE</name>
                     <description>CFIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXEFS</name>
               <displayName>FDCAN_TXEFS</displayName>
               <description>FDCAN Tx Event FIFO Status           Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFFL</name>
                     <description>EFFL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>EFGI</name>
                     <description>EFGI</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EFPI</name>
                     <description>EFPI</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EFF</name>
                     <description>EFF</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEFL</name>
                     <description>TEFL</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_TXEFA</name>
               <displayName>FDCAN_TXEFA</displayName>
               <description>FDCAN Tx Event FIFO Acknowledge           Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFAI</name>
                     <description>EFAI</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDCAN_CKDIV</name>
               <displayName>FDCAN_CKDIV</displayName>
               <description>FDCAN CFG clock divider           register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PDIV</name>
                     <description>input clock divider. the APB clock could               be divided prior to be used by the CAN               sub</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
