rgw3d/1KCubeSat_Software/svd/STM32G4xx.svd
            <register>
               <name>TX_ORDSET</name>
               <displayName>TX_ORDSET</displayName>
               <description>UCPD Tx Ordered Set Type           Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXORDSET</name>
                     <description>TXORDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_PAYSZ</name>
               <displayName>TX_PAYSZ</displayName>
               <description>UCPD Tx Paysize Register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXPAYSZ</name>
                     <description>TXPAYSZ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDR</name>
               <displayName>TXDR</displayName>
               <description>UCPD Tx Data Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>TXDATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_ORDSET</name>
               <displayName>RX_ORDSET</displayName>
               <description>UCPD Rx Ordered Set Register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXORDSET</name>
                     <description>RXORDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RXSOP3OF4</name>
                     <description>RXSOP3OF4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSOPKINVALID</name>
                     <description>RXSOPKINVALID</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_PAYSZ</name>
               <displayName>RX_PAYSZ</displayName>
               <description>UCPD Rx Paysize Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXPAYSZ</name>
                     <description>RXPAYSZ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXDR</name>
               <displayName>RXDR</displayName>
               <description>UCPD Rx Data Register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>RXDATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_ORDEXT1</name>
               <displayName>RX_ORDEXT1</displayName>
               <description>UCPD Rx Ordered Set Extension Register           1</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXSOPX1</name>
                     <description>RXSOPX1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_ORDEXT2</name>
               <displayName>RX_ORDEXT2</displayName>
               <description>UCPD Rx Ordered Set Extension Register           2</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXSOPX2</name>
                     <description>RXSOPX2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
